InformationRegisters/Дерби.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Дерби</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Противник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Дерби/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого ТекЭлемент Из ЭтотОбъект Цикл
		Если ТекЭлемент.Команда = ТекЭлемент.Противник Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрШаблон("Команды должны различаться (%1)", ТекЭлемент.Команда), Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Команда		= Неопределено;
	Противник	= Неопределено;
	Для Каждого ТекЭлемент Из ЭтотОбъект Цикл
		Противник	= ТекЭлемент.Команда;
		Команда		= ТекЭлемент.Противник;
	КонецЦикла;
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.Дерби КАК Дерби
		|ГДЕ
		|	Дерби.Команда = &Команда
		|	И Дерби.Противник = &Противник");
		Запрос.УстановитьПараметр("Команда",		Команда);
		Запрос.УстановитьПараметр("Противник",		Противник);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
